yamaxgucci/esp32-os/apps/md/core/vdp/gwenesis_vdp_gfx.c
void gwenesis_vdp_render_line(int line)
{
  mode_h40 = REG12_MODE_H40;
  //mode_pal = REG1_PAL;

  vdpg_log(__FUNCTION__,": %3d",line);

  //unsigned int line = scan_line;
  //  if (line == 0) gwenesis_vdp_render_config();

  // interlace mode not implemented
  if (BITS(gwenesis_vdp_regs[12], 1, 2) != 0)
    return;

  if (line >= (REG1_PAL ? 240 : 224))
    return;


#if GNW_TARGET_MARIO != 0 | GNW_TARGET_ZELDA != 0 | ARGON_TARGET != 0

  screen_buffer_line = &screen_buffer[line * screen_buffer_stride];

  // Disable display >> black screen
  if (REG0_DISABLE_DISPLAY){
    memset(screen_buffer_line, 0, SCREEN_WIDTH*2);
    return;
  }

  // Display is not enabled. fill with background colour
  if (REG1_DISP_ENABLED == 0) {
    for (int px=0; px < 320;px++) 
      screen_buffer_line[px]=CRAM565[0];
    return;
  }
  #else

  // Disable display >> black screen
  if (REG0_DISABLE_DISPLAY){
    memset(screen, 0, SCREEN_WIDTH*3);
    return;
  }

  // Dsiaply is not enabled. fill with background colour
  if (REG1_DISP_ENABLED == 0) {
      uint16_t rgb565 = CRAM565[0];
      uint8_t r, g, b;
      r = (rgb565 & 0xF800) >> 8;
      g = (rgb565 & 0X07E0) >> 3;
      b = (rgb565 & 0x001F) << 3;

    for (int px=0; px < 320;px++) {
      screen[3*px]=r;
      screen[3*px+1]=g;
      screen[3*px+2]=b;
    }
    return;
  }

#endif

  uint8_t *pb = &render_buffer[PIX_OVERFLOW];
  uint8_t *ps = &sprite_buffer[PIX_OVERFLOW];

  if (MODE_SHI)
    memset(ps, 0, 320);

  draw_line_b(line);
  draw_line_aw(line);

  if (MODE_SHI)
    draw_sprites(line);
  else
    draw_sprites_over_planes(line);

#if GNW_TARGET_MARIO != 0 | GNW_TARGET_ZELDA != 0 | ARGON_TARGET != 0

  if (screen_width == 320) {
    /* Mode Highlight/shadow is enabled */
    if (MODE_SHI) {
      for (int x = 0; x < screen_width; x++) {
        uint8_t plane = pb[x];
        uint8_t sprite = ps[x];

        if ((plane & 0xC0) < (sprite & 0xC0)) {
          switch (sprite & 0x3F) {
          // Palette=3, Sprite=14 :> draw plane, force highlight
          case 0x3E:
            screen_buffer_line[x] = 0x8410 | CRAM565[plane] >> 1;
            break;
          // Palette=3, Sprite=15 :> draw plane, force shadow
          case 0x3F:
            screen_buffer_line[x] = CRAM565[plane] >> 1;
            break;
          // draw sprite, normal
          default:
            screen_buffer_line[x] = CRAM565[sprite];
            break;
          }
        } else {
          screen_buffer_line[x] = CRAM565[plane];
        }
      }

      /* Normal mode*/
    } else {

      uint32_t *video_out = (uint32_t *)&screen_buffer_line[0];

      for (int x = 0; x < screen_width; x += 2) {

        // screen_buffer_line[x] = CRAM565[pb[x]];
        //  2 pixels : 32 bits write  access is faster
        *video_out++ = CRAM565[pb[x]] | CRAM565[pb[x + 1]] << 16;
      }
    }
    /* upscale mode H32 to H40 */
  } else {

    uint16_t buffer_line_H32[256];

    /* Mode Highlight/shadow is enabled */
    if (MODE_SHI) {
      for (int x = 0; x < screen_width; x++) {
        uint8_t plane = pb[x];
        uint8_t sprite = ps[x];

        if ((plane & 0xC0) < (sprite & 0xC0)) {
          switch (sprite & 0x3F) {
          // Palette=3, Sprite=14 :> draw plane, force highlight
          case 0x3E:
            buffer_line_H32[x] = 0x8410 | CRAM565[plane] >> 1;
            break;
          // Palette=3, Sprite=15 :> draw plane, force shadow
          case 0x3F:
            buffer_line_H32[x] = CRAM565[plane] >> 1;
            break;
          // draw sprite, normal
          default:
            buffer_line_H32[x] = CRAM565[sprite];
            break;
          }
        } else {
          buffer_line_H32[x] = CRAM565[plane];
        }
      }

      /* Normal mode*/
    } else {

      for (int x = 0; x < screen_width; x++)
        buffer_line_H32[x] = CRAM565[pb[x]];
    }

    uint16_t scaled_buffer_line[320];
    
    blit_4to5_line(buffer_line_H32, scaled_buffer_line);

    uint32_t *video_out = (uint32_t *)&screen_buffer_line[0];

    for (int x = 0; x < 320; x += 2) {

      // screen_buffer_line[x] = CRAM565[pb[x]];
      //  2 pixels : 32 bits write  access is faster
      *video_out++ = scaled_buffer_line[x] | scaled_buffer_line[x + 1] << 16;
    }
  }
#else
  uint16_t rgb565;
  uint16_t tmp_line[320];
  uint16_t scaled_line[320];

  /* Mode Highlight/shadow is enabled */
  if (MODE_SHI) {
    for (int x = 0; x < screen_width; x++) {
      uint8_t plane = pb[x];
      uint8_t sprite = ps[x];

      if ((plane & 0xC0) < (sprite & 0xC0) ) {
        switch (sprite & 0x3F) {
        // Palette=3, Sprite=14 :> draw plane, force highlight
        case 0x3E:
          rgb565 = 0x8410 | CRAM565[plane] >> 1;
          break;
        // Palette=3, Sprite=15 :> draw plane, force shadow
        case 0x3F:
          rgb565 = CRAM565[plane] >> 1;
          break;
        // draw sprite, normal
        default:
          rgb565 = CRAM565[sprite];
          break;
        }
      } else {
        rgb565 = CRAM565[plane];
      }
      tmp_line[x]=rgb565;
      /*
      uint8_t r, g, b;
      r = (rgb565 & 0xF800) >> 8;
      g = (rgb565 & 0X07E0) >> 3;
      b = (rgb565 & 0x001F) << 3;
      int pixel = ((240 - screen_height) / 2 + (line)) * 320 + (x) +
                  (320 - screen_width) / 2;
      screen[pixel * 4 + 2] = r;
      screen[pixel * 4 + 1] = g;
      screen[pixel * 4 + 0] = b;
      */
    }

    /* Normal mode*/
  } else {
    for (int x = 0; x < screen_width; x++) {
      tmp_line[x]=CRAM565[pb[x]];

      /*
      rgb565 = CRAM565[pb[x]];
      uint8_t r, g, b;
      r = (rgb565 & 0xF800) >> 8;
      g = (rgb565 & 0X07E0) >> 3;
      b = (rgb565 & 0x001F) << 3;

      int pixel = ((240 - screen_height) / 2 + (line)) * 320 + (x) +
                  (320 - screen_width) / 2;
      screen[pixel * 4 + 2] = r;
      screen[pixel * 4 + 1] = g;
      screen[pixel * 4 + 0] = b;
      */
    }
  }
  // Mode H32  horizontal upscale 256 >>> 320
  if ( screen_width == 256) {

  blit_4to5_line(tmp_line,scaled_line);

