yamaxgucci/esp32-os/apps/md/core/vdp/gwenesis_vdp_gfx.c
  // RGB565 to RGB24
  for (int x = 0; x < 320; x++) {
    uint8_t r, g, b;
    r = (scaled_line[x] & 0xF800) >> 8;
    g = (scaled_line[x] & 0X07E0) >> 3;
    b = (scaled_line[x] & 0x001F) << 3;
    int pixel = ((240 - screen_height) / 2 + (line)) * 320 + (x); // + (320 - screen_width) / 2;
    screen[pixel * 4 + 2] = r;
    screen[pixel * 4 + 1] = g;
    screen[pixel * 4 + 0] = b;
  }
  // Mode H40
  } else {

  // RGB565 to RGB24
  for (int x = 0; x < 320; x++) {
    uint8_t r, g, b;
    r = (tmp_line[x] & 0xF800) >> 8;
    g = (tmp_line[x] & 0X07E0) >> 3;
    b = (tmp_line[x] & 0x001F) << 3;
    int pixel = ((240 - screen_height) / 2 + (line)) * 320 + (x);// + (320 - screen_width) / 2;
    screen[pixel * 4 + 2] = r;
    screen[pixel * 4 + 1] = g;
    screen[pixel * 4 + 0] = b;
  }
  }


#endif
}

void gwenesis_vdp_gfx_save_state() {
  /*
  SaveState* state;
  state = saveGwenesisStateOpenForWrite("vdp_gfx");
  saveGwenesisStateSetBuffer(state, "render_buffer", render_buffer, sizeof(render_buffer));
  saveGwenesisStateSetBuffer(state, "sprite_buffer", sprite_buffer, sizeof(sprite_buffer));
  saveGwenesisStateSet(state, "mode_h40", mode_h40);
  saveGwenesisStateSet(state, "mode_pal", mode_pal);
  saveGwenesisStateSet(state, "screen_width", screen_width);
  saveGwenesisStateSet(state, "screen_height", screen_height);
  saveGwenesisStateSet(state, "sprite_overflow", sprite_overflow);
  saveGwenesisStateSet(state, "sprite_collision", sprite_collision);
  saveGwenesisStateSet(state, "base_w", base_w);
  saveGwenesisStateSet(state, "PlanA_firstcol", PlanA_firstcol);
  saveGwenesisStateSet(state, "PlanA_lastcol", PlanA_lastcol);
  saveGwenesisStateSet(state, "Window_firstcol", Window_firstcol);
  saveGwenesisStateSet(state, "Window_lastcol", Window_lastcol);
  */
}

void gwenesis_vdp_gfx_load_state() {
  /*
    SaveState* state = saveGwenesisStateOpenForRead("vdp_gfx");
    saveGwenesisStateGetBuffer(state, "render_buffer", render_buffer, sizeof(render_buffer));
    saveGwenesisStateGetBuffer(state, "sprite_buffer", sprite_buffer, sizeof(sprite_buffer));
    mode_h40 = saveGwenesisStateGet(state, "mode_h40");
    mode_pal = saveGwenesisStateGet(state, "mode_pal");
    screen_width = saveGwenesisStateGet(state, "screen_width");
    screen_height = saveGwenesisStateGet(state, "screen_height");
    sprite_overflow = saveGwenesisStateGet(state, "sprite_overflow");
    sprite_collision = saveGwenesisStateGet(state, "sprite_collision");
    base_w = saveGwenesisStateGet(state, "base_w");
    PlanA_firstcol = saveGwenesisStateGet(state, "PlanA_firstcol");
    PlanA_lastcol = saveGwenesisStateGet(state, "PlanA_lastcol");
    Window_firstcol = saveGwenesisStateGet(state, "Window_firstcol");
    Window_lastcol = saveGwenesisStateGet(state, "Window_lastcol");
    */
}
